Repository: tiann/hapi
Catalog: ios/Hapi/Resources/Localizable.xcstrings
Source language: en
Languages: ru, zh_hans

source: Name needs at least one letter or digit
ru: Имя должно содержать хотя бы одну букву или цифру
zh_hans: 名称需要至少一个字母或数字

source: Needs approval
ru: Нужно одобрение
zh_hans: 待批准

source: Needs attention
ru: Требует внимания
zh_hans: 待处理

source: Needs reply
ru: Нужен ответ
zh_hans: 待回复

source: New Session
ru: Новая сессия
zh_hans: 新建会话

source: New note
ru: Новая заметка
zh_hans: 新建笔记

source: Next part
ru: Следующая часть
zh_hans: 下一部分

source: Next question
ru: Следующий вопрос
zh_hans: 下一题

source: Next tool
ru: Следующий инструмент
zh_hans: 下一个工具

source: No HAPI hub answered at this address. Check that the hub is running and that this device can reach it (same network, or the relay tunnel is up).
ru: По этому адресу не ответил ни один хаб HAPI. Проверьте, что хаб запущен и это устройство может до него добраться (та же сеть или активный туннель реле).
zh_hans: 该地址没有 HAPI Hub 应答。请确认 Hub 正在运行，且本设备能够访问它（处于同一网络，或中继隧道已开启）。

source: No agent steps available yet.
ru: Шагов агента пока нет.
zh_hans: 暂无可显示的子代理步骤。

source: No audio was recorded
ru: Звук не записан
zh_hans: 未录到任何音频

source: No changes in the working tree
ru: В рабочем дереве нет изменений
zh_hans: 工作区暂无变更

source: No changes in this file
ru: В этом файле нет изменений
zh_hans: 此文件没有变更

source: No drafts yet
ru: Черновиков пока нет
zh_hans: 暂无草稿

source: No files matched
ru: Файлы не найдены
zh_hans: 没有匹配的文件

source: No filters
ru: Нет фильтров
zh_hans: 未启用筛选

source: No machines online
ru: Нет машин онлайн
zh_hans: 没有在线机器

source: No matching directories
ru: Подходящих каталогов нет
zh_hans: 没有匹配的目录

source: No messages yet
ru: Сообщений пока нет
zh_hans: 还没有消息

source: No notes
ru: Нет заметок
zh_hans: 暂无笔记

source: No notes yet
ru: Заметок пока нет
zh_hans: 还没有笔记

source: No output
ru: Нет вывода
zh_hans: 无输出

source: No sessions yet
ru: Сессий пока нет
zh_hans: 还没有会话

source: No settings available for this session.
ru: Для этой сессии нет доступных настроек.
zh_hans: 此会话没有可用设置。

source: No storage data reported.
ru: Данные о хранилище не переданы.
zh_hans: 暂无存储数据。

source: No subdirectories
ru: Нет подкаталогов
zh_hans: 没有子目录

source: No supported Agents are installed on this machine.
ru: На этой машине не установлено ни одного поддерживаемого агента.
zh_hans: 此机器上没有安装受支持的代理。

source: No transcription provider configured on hub
ru: На хабе не настроен провайдер транскрипции
zh_hans: Hub 尚未配置转录提供商

source: No usage recorded in this period.
ru: За этот период использование не зафиксировано.
zh_hans: 此范围内没有记录到 Token 用量。

source: None of the above
ru: Ничего из перечисленного
zh_hans: 以上都不是

source: Not delivered
ru: Не доставлено
zh_hans: 未送达

source: Not delivered — tap to retry
ru: Не доставлено — нажмите, чтобы повторить
zh_hans: 未送达 — 点按重试

source: Not requested
ru: Не запрошено
zh_hans: 未请求

source: Not selected
ru: Не выбрано
zh_hans: 未选择

source: Note
ru: Примечание
zh_hans: 备注

source: Note, draft, parking-lot idea…
ru: Заметка, черновик, идея на потом…
zh_hans: 笔记、草稿或想法…

source: Notifications
ru: Уведомления
zh_hans: 通知

source: OK
ru: ОК
zh_hans: 好

source: OLED black
ru: Чёрная OLED
zh_hans: OLED 纯黑

source: Offline
ru: Офлайн
zh_hans: 离线

source: Offline — showing cached sessions
ru: Офлайн — показаны кешированные сессии
zh_hans: 离线 — 显示缓存的会话

source: Open
ru: Открыть
zh_hans: 打开

source: Open Settings
ru: Открыть Настройки
zh_hans: 打开设置

source: Open URL
ru: Открыть URL
zh_hans: 打开链接

source: Open link?
ru: Открыть ссылку?
zh_hans: 打开此链接？

source: Optional
ru: Необязательно
zh_hans: 可选

source: Optionally, add details in notes.
ru: При желании добавьте подробности в примечании.
zh_hans: 可在备注中补充说明（可选）。

source: Options
ru: Варианты
zh_hans: 选项

source: Other answer
ru: Другой ответ
zh_hans: 其他答案

source: Other…
ru: Другое…
zh_hans: 其他…

source: Output
ru: Вывод
zh_hans: 输出

source: Pair
ru: Сопрячь
zh_hans: 配对

source: Pair with your hub
ru: Сопряжение с хабом
zh_hans: 与你的 Hub 配对

source: Pairing details filled in. Review them, then tap Pair.
ru: Данные для сопряжения заполнены. Проверьте их и нажмите «Сопрячь».
zh_hans: 配对信息已填入，请确认后点击「配对」。

source: Pairing succeeded but the credentials could not be stored on this device. Try again.
ru: Сопряжение удалось, но учётные данные не удалось сохранить на этом устройстве. Попробуйте снова.
zh_hans: 配对成功，但凭据无法保存到此设备。请重试。

source: Pairing…
ru: Сопряжение…
zh_hans: 配对中…

source: Park current draft
ru: Отложить текущий черновик
zh_hans: 暂存当前草稿

source: Park drafts from the header, or tap + to jot a note for this session.
ru: Откладывайте черновики из шапки или нажмите +, чтобы записать заметку для этой сессии.
zh_hans: 从顶部暂存草稿，或点按 + 为此会话记一条笔记。

source: Part %lld
ru: Часть %lld
zh_hans: 第 %lld 部分

source: Path
ru: Путь
zh_hans: 路径

source: Path is outside workspace roots
ru: Путь вне корней рабочего пространства
zh_hans: 目录不在此机器允许的工作区内。

source: Paused
ru: Приостановлено
zh_hans: 已暂停

source: Permission Mode
ru: Режим разрешений
zh_hans: 权限模式

source: Permission mode
ru: Режим разрешений
zh_hans: 权限模式

source: Permission modes control how the agent requests approval. Behavior varies by agent.
ru: Режимы разрешений определяют, как агент запрашивает одобрение. Поведение зависит от агента.
zh_hans: 权限模式控制代理请求审批的方式，具体行为因代理而异。

source: Permission request
ru: Запрос разрешения
zh_hans: 权限请求

source: Permission: %@
ru: Разрешение: %@
zh_hans: 权限：%@

source: Photo library
ru: Галерея
zh_hans: 照片图库

source: Pin Globally
ru: Закрепить глобально
zh_hans: 全局置顶

source: Pin failed: %@
ru: Не удалось закрепить: %@
zh_hans: 置顶操作失败：%@

source: Pin to Project
ru: Закрепить за проектом
zh_hans: 项目置顶

source: Pinned
ru: Закреплённые
zh_hans: 置顶

source: Plan
ru: План
zh_hans: 计划

source: Plan proposal
ru: Предложение плана
zh_hans: 计划提案

source: Point the camera at the pairing QR from the hub terminal or the web app's Companion Pairing settings.
ru: Наведите камеру на QR-код сопряжения из терминала хаба или из настроек Companion Pairing веб-приложения.
zh_hans: 将相机对准 Hub 终端或网页版「伴侣应用配对」设置中的配对二维码。

source: Preview
ru: Предпросмотр
zh_hans: 预览

source: Preview not available for this image format
ru: Предпросмотр для этого формата изображения недоступен
zh_hans: 此图片格式不支持预览

source: Previous part
ru: Предыдущая часть
zh_hans: 上一部分

source: Previous question
ru: Предыдущий вопрос
zh_hans: 上一题

source: Previous tool
ru: Предыдущий инструмент
zh_hans: 上一个工具

source: Printed by the hub at startup, or available in web Settings → Companion Pairing. You can also paste a pairing link here.
ru: Печатается хабом при запуске или доступен в веб-Настройках → Companion Pairing. Здесь также можно вставить ссылку для сопряжения.
zh_hans: 可在 Hub 启动信息或网页版「设置 → 伴侣应用配对」中获取。也可在此粘贴配对链接。

source: Privacy Policy
ru: Политика конфиденциальности
zh_hans: 隐私政策

source: Project root
ru: Корень проекта
zh_hans: 项目根目录

source: Protocol version
ru: Версия протокола
zh_hans: 协议版本

source: Pull to retry once you are back online.
ru: Потяните, чтобы повторить, когда вернётесь онлайн.
zh_hans: 恢复在线后下拉重试。

source: Push notifications
ru: Push-уведомления
zh_hans: 推送通知

source: Pushes are end-to-end encrypted; only this device can read them.
ru: Push-уведомления защищены сквозным шифрованием; прочитать их может только это устройство.
zh_hans: 推送经过端到端加密，只有本机可以读取。

source: Query
ru: Запрос
zh_hans: 查询

source: Question
ru: Вопрос
zh_hans: 问题

source: Question %lld of %lld
ru: Вопрос %lld из %lld
zh_hans: 第 %1$lld 题，共 %2$lld 题

source: Question canceled
ru: Вопрос отменён
zh_hans: 问题已取消

source: Question failed
ru: Вопрос не выполнен
zh_hans: 问题处理失败

source: Question handled
ru: Вопрос обработан
zh_hans: 已处理

source: Questions & Answers
ru: Вопросы и ответы
zh_hans: 问答

source: Range
ru: Диапазон
zh_hans: 范围

source: Re-register push
ru: Перерегистрировать push
zh_hans: 重新注册推送

source: Read file
ru: Чтение файла
zh_hans: 读取文件

source: Read notebook
ru: Чтение блокнота
zh_hans: 读取笔记本

source: Reasoning
ru: Рассуждения
zh_hans: 思考

source: Reasoning Effort
ru: Усилие рассуждений
zh_hans: 推理强度

source: Reasoning…
ru: Рассуждения…
zh_hans: 思考中…

source: Recommended
ru: Рекомендуется
zh_hans: 推荐

source: Reconnecting…
ru: Переподключение…
zh_hans: 重连中…

source: Refresh
ru: Обновить
zh_hans: 刷新

source: Refreshing…
ru: Обновление…
zh_hans: 正在刷新…

source: Registered hubs
ru: Зарегистрированные хабы
zh_hans: 已注册的 Hub

source: Remove
ru: Удалить
zh_hans: 移除

source: Remove %@
ru: Удалить %@
zh_hans: 移除 %@

source: Removes the stored access token for this hub. Pair again to reconnect.
ru: Удаляет сохранённый токен доступа для этого хаба. Сопрягите заново, чтобы переподключиться.
zh_hans: 将移除此 Hub 已保存的访问令牌。重新配对即可再次连接。

source: Reply
ru: Ответить
zh_hans: 回复

source: Request failed
ru: Запрос не выполнен
zh_hans: 请求失败

source: Request was already handled
ru: Запрос уже обработан
zh_hans: 请求已被处理

source: Requests
ru: Запросы
zh_hans: 请求数

source: Result
ru: Результат
zh_hans: 结果

source: Result · error
ru: Результат · ошибка
zh_hans: 结果 · 错误

source: Resume agent
ru: Возобновить агента
zh_hans: 恢复代理

source: Retry
ru: Повторить
zh_hans: 重试

source: Retry removal
ru: Повторить удаление
zh_hans: 重试移除

source: Run script
ru: Запустить скрипт
zh_hans: 运行脚本

source: Run shell
ru: Запуск оболочки
zh_hans: 运行命令

source: Runner last spawn error: %@
ru: Последняя ошибка запуска раннера: %@
zh_hans: Runner 上次启动错误：%@

source: Running
ru: Выполняется
zh_hans: 运行中

source: SQLite files
ru: Файлы SQLite
zh_hans: SQLite 文件

source: Save
ru: Сохранить
zh_hans: 保存

source: Save draft
ru: Сохранить черновик
zh_hans: 暂存

source: Save input, then take draft
ru: Сохранить ввод, затем взять черновик
zh_hans: 先暂存，再取回

source: Scan Again
ru: Сканировать снова
zh_hans: 重新扫描

source: Scan QR Code
ru: Сканировать QR-код
zh_hans: 扫描二维码

source: Scan to Pair
ru: Сканировать для сопряжения
zh_hans: 扫码配对

source: Scanning unavailable
ru: Сканирование недоступно
zh_hans: 无法扫码

source: Scheduled · %@
ru: По расписанию · %@
zh_hans: 定时发送 · %@

source: Scratchlist
ru: Заметки
zh_hans: 草稿夹

source: Scratchlist (%lld)
ru: Заметки (%lld)
zh_hans: 草稿夹（%lld）

source: Scratchlist is full (200 entries)
ru: Заметки заполнены (200 записей)
zh_hans: 草稿夹已满（200 条）

source: Scratchlist is full (200 entries) — delete one first
ru: Заметки заполнены (200 записей) — сначала удалите одну
zh_hans: 草稿夹已满（200 条）— 请先删除一条

source: Search
ru: Поиск
zh_hans: 搜索

source: Search content
ru: Поиск по содержимому
zh_hans: 搜索内容

source: Search drafts
ru: Поиск черновиков
zh_hans: 搜索草稿

source: Search files
ru: Поиск файлов
zh_hans: 搜索文件

source: Search files…
ru: Поиск файлов…
zh_hans: 搜索文件…

source: Searching directories…
ru: Поиск каталогов…
zh_hans: 正在查找目录…

source: Section
ru: Раздел
zh_hans: 分区

source: Select
ru: Выбрать
zh_hans: 选择

source: Select a session
ru: Выберите сессию
zh_hans: 选择一个会话

source: Select all that apply
ru: Выберите все подходящие
zh_hans: 可多选

source: Selected
ru: Выбрано
zh_hans: 已选择

source: Selected machine is offline
ru: Выбранная машина офлайн
zh_hans: 所选机器已离线

source: Selected machine is offline. Choose an online machine.
ru: Выбранная машина офлайн. Выберите машину онлайн.
zh_hans: 所选机器已离线，请选择一台在线机器。

source: Send
ru: Отправить
zh_hans: 发送

source: Send & steer into current turn
ru: Отправить и вклиниться в текущий ход
zh_hans: 发送并插入当前回合

source: Send — long-press to steer
ru: Отправить — долгое нажатие, чтобы направить
zh_hans: 发送 — 长按可插入当前回合

source: Session Settings
ru: Настройки сессии
zh_hans: 会话设置

source: Session Type
ru: Тип сессии
zh_hans: 会话类型

source: Session files
ru: Файлы сессии
zh_hans: 会话文件

source: Session is controlled from the terminal — config changes will be rejected.
ru: Сессией управляют из терминала — изменения конфигурации будут отклонены.
zh_hans: 会话正由终端控制 — 配置更改将被拒绝。

source: Session is inactive and could not be resumed
ru: Сессия неактивна, и её не удалось возобновить
zh_hans: 会话未激活且无法恢复

source: Session is offline — changes apply after it resumes or may be rejected.
ru: Сессия офлайн — изменения применятся после возобновления или могут быть отклонены.
zh_hans: 会话已离线 — 更改将在恢复后生效，也可能被拒绝。

source: Session not found on any paired hub.
ru: Сессия не найдена ни на одном сопряжённом хабе.
zh_hans: 任何已配对的 Hub 上都找不到该会话。

source: Session settings
ru: Настройки сессии
zh_hans: 会话设置

source: Session type
ru: Тип сессии
zh_hans: 会话类型

source: Sessions
ru: Сессии
zh_hans: 会话

source: Sessions with usage: %lld
ru: Сессий с использованием: %lld
zh_hans: 有用量记录的会话：%lld

source: Settings
ru: Настройки
zh_hans: 设置

source: Setup guide
ru: Руководство по настройке
zh_hans: 设置指南

source: Share file
ru: Поделиться файлом
zh_hans: 分享文件

source: Shared memory
ru: Общая память
zh_hans: 共享内存

source: Show Hidden
ru: Показывать скрытые
zh_hans: 显示隐藏目录

source: Show all %lld lines
ru: Показать все строки: %lld
zh_hans: 显示全部 %lld 行

source: Show hidden files
ru: Показывать скрытые файлы
zh_hans: 显示隐藏文件

source: Show image
ru: Показать изображение
zh_hans: 展示图片

source: Show video
ru: Показать видео
zh_hans: 展示视频

source: Showing %lld of %lld parts
ru: Показано %lld из %lld частей
zh_hans: 已显示 %lld 部分，共 %lld 部分

source: Showing the last available group. Live group updates are unavailable.
ru: Показана последняя доступная группа. Живые обновления группы недоступны.
zh_hans: 正在显示工具组的最后可用记录，工具组已无法实时更新。

source: Showing the last available record. Live updates are unavailable for this tool.
ru: Показана последняя доступная запись. Живые обновления для этого инструмента недоступны.
zh_hans: 正在显示最后保留的记录，此工具已无法实时更新。

source: Shutdown Response
ru: Ответ на завершение
zh_hans: 关闭响应

source: Shutdown: %@
ru: Завершение: %@
zh_hans: 关闭：%@

source: Sign Out
ru: Выйти
zh_hans: 退出登录

source: Sign Out…
ru: Выйти…
zh_hans: 退出登录…

source: Sign out of %@?
ru: Выйти из %@?
zh_hans: 退出 %@ 的登录？

source: Signed out of %@
ru: Вы вышли из %@
zh_hans: 已退出 %@ 的登录

source: Simple
ru: Обычная
zh_hans: 简单

source: Source
ru: Исходник
zh_hans: 源码

source: Spawn agent
ru: Запустить агента
zh_hans: 创建代理

source: Staged
ru: В индексе
zh_hans: 已暂存

source: Staged (%lld)
ru: В индексе (%lld)
zh_hans: 已暂存（%lld）

source: Standard
ru: Стандартный
zh_hans: 标准

source: Start an agent with the hapi CLI and it will appear here.
ru: Запустите агента через CLI hapi, и он появится здесь.
zh_hans: 用 hapi CLI 启动一个智能体，会话就会出现在这里。

source: Status: %@ · protocol v%lld
ru: Статус: %@ · протокол v%lld
zh_hans: 状态：%@ · 协议 v%lld

source: Steer
ru: Направить
zh_hans: 插入

source: Stop dictation
ru: Остановить диктовку
zh_hans: 停止语音输入

source: Stop the current turn
ru: Остановить текущий ход
zh_hans: 停止当前回合

source: Storage
ru: Хранилище
zh_hans: 存储空间

source: Subdirectories
ru: Подкаталоги
zh_hans: 子目录

source: Submit
ru: Отправить
zh_hans: 提交

source: Submit answer
ru: Отправить ответ
zh_hans: 提交回答

source: Submitting answer…
ru: Отправка ответа…
zh_hans: 正在提交回答…

source: Submitting approval…
ru: Отправка одобрения…
zh_hans: 正在提交授权…

source: Take draft
ru: Взять черновик
zh_hans: 取回

source: Team: %@
ru: Команда: %@
zh_hans: 团队：%@

source: Terminal
ru: Терминал
zh_hans: 终端

source: That code is not a HAPI pairing QR — scan one printed by the hub.
ru: Этот код не является QR-кодом сопряжения HAPI — отсканируйте напечатанный хабом.
zh_hans: 这不是 HAPI 配对二维码 — 请扫描 Hub 打印的二维码。

source: That file is over the %lld MB limit
ru: Этот файл превышает лимит %lld МБ
zh_hans: 该文件超过 %lld MB 上限

source: That file is over the hub's per-file size limit
ru: Этот файл превышает лимит размера файла на хабе
zh_hans: 该文件超过 Hub 的单文件大小上限

source: That file type isn't allowed for scratchlist attachments
ru: Этот тип файла не разрешён для вложений в заметки
zh_hans: 草稿夹附件不支持该文件类型

source: The app checks the hub is reachable, then exchanges the token for a session.
ru: Приложение проверяет доступность хаба, затем обменивает токен на сессию.
zh_hans: 应用会先确认 Hub 可达，再用令牌换取会话。

source: The attachments exceed the scratchlist limits — remove a file or choose a smaller one
ru: Вложения превышают лимиты заметок — удалите файл или выберите меньший
zh_hans: 附件超出草稿夹限制，请移除附件或选择更小的文件

source: The hub answered unexpectedly (HTTP %lld). Try again in a moment.
ru: Хаб ответил неожиданно (HTTP %lld). Попробуйте снова через мгновение.
zh_hans: Hub 返回了意外响应（HTTP %lld）。请稍后重试。

source: The hub rejected the stored credentials — the access token was probably rotated. Pair again to reconnect.
ru: Хаб отклонил сохранённые учётные данные — вероятно, токен доступа был обновлён. Сопрягите заново, чтобы переподключиться.
zh_hans: Hub 拒绝了已保存的凭据 — 访问令牌可能已被轮换。请重新配对以恢复连接。

source: The hub rejected this access token — it may have been rotated. Get a fresh pairing code from the hub and try again.
ru: Хаб отклонил этот токен доступа — возможно, он был обновлён. Получите свежий код сопряжения с хаба и попробуйте снова.
zh_hans: Hub 拒绝了此访问令牌 — 它可能已被轮换。请从 Hub 获取新的配对码后重试。

source: The hub speaks protocol v%lld, this app supports v%lld. Update the older side, then try again.
ru: Хаб использует протокол v%lld, а это приложение поддерживает v%lld. Обновите более старую сторону и попробуйте снова.
zh_hans: Hub 使用协议 v%lld，本应用支持 v%lld。请升级较旧的一方后重试。

source: The selected Agent is not available on this machine.
ru: Выбранный агент недоступен на этой машине.
zh_hans: 所选代理在此机器上不可用。

source: The session is no longer active.
ru: Сессия больше не активна.
zh_hans: 该会话已不再活跃。

source: Theme
ru: Тема
zh_hans: 主题

source: Thinking
ru: Думает
zh_hans: 思考中

source: This agent manages its own permissions. YOLO mode is not available.
ru: Этот агент сам управляет разрешениями. Режим YOLO недоступен.
zh_hans: 此代理自行管理权限，YOLO 模式不适用。

source: This dashboard is only available to the hub owner (default namespace).
ru: Эта панель доступна только владельцу хаба (пространство имён по умолчанию).
zh_hans: 此看板仅 Hub 所有者（default 命名空间）可用。

source: This device cannot scan QR codes (for example the Simulator). Go back and use manual entry instead.
ru: Это устройство не может сканировать QR-коды (например, симулятор). Вернитесь и введите данные вручную.
zh_hans: 此设备无法扫描二维码（例如模拟器）。请返回并使用手动输入。

source: This file is empty
ru: Этот файл пуст
zh_hans: 文件为空

source: This hub will be added to your paired hubs and become active.
ru: Этот хаб будет добавлен к сопряжённым и станет активным.
zh_hans: 此 Hub 将加入已配对列表并成为当前 Hub。

source: This note's attachment budget is used up
ru: Бюджет вложений этой заметки исчерпан
zh_hans: 此笔记的附件配额已用完

source: This pairing link is invalid or incomplete. Copy the full link from your hub.
ru: Эта ссылка для сопряжения недействительна или неполна. Скопируйте полную ссылку с хаба.
zh_hans: 配对链接无效或不完整。请从 Hub 复制完整链接。

source: This question could not be displayed. Open details to inspect the request.
ru: Не удалось показать этот вопрос. Откройте детали, чтобы изучить запрос.
zh_hans: 无法显示这个问题。请打开详情查看原始请求。

source: To composer
ru: В поле ввода
zh_hans: 复制到输入框

source: Todo list
ru: Список задач
zh_hans: 任务清单

source: Token rejected
ru: Токен отклонён
zh_hans: 令牌被拒绝

source: Token usage across agents and models
ru: Использование токенов по агентам и моделям
zh_hans: 各 Agent 与模型的 Token 用量

source: Tool %lld of %lld
ru: Инструмент %lld из %lld
zh_hans: 第 %lld 个工具，共 %lld 个

source: Tool details
ru: Детали инструмента
zh_hans: 工具详情

source: Total
ru: Итого
zh_hans: 总计

source: Total tokens
ru: Всего токенов
zh_hans: 总 Token

source: Transcription failed
ru: Ошибка транскрипции
zh_hans: 转录失败

source: Try Again
ru: Повторить
zh_hans: 重试

source: Type an answer first
ru: Сначала введите ответ
zh_hans: 请先输入答案

source: Type to search files in the session directory
ru: Начните вводить текст для поиска файлов в каталоге сессии
zh_hans: 输入以在会话目录中搜索文件

source: Type your answer…
ru: Введите ответ…
zh_hans: 输入您的答案…

source: Uncached
ru: Без кеша
zh_hans: 非缓存

source: Unknown machine
ru: Неизвестная машина
zh_hans: 未知机器

source: Unpin
ru: Открепить
zh_hans: 取消置顶

source: Unread
ru: Непрочитано
zh_hans: 未读

source: Unstaged
ru: Вне индекса
zh_hans: 未暂存

source: Unstaged (%lld)
ru: Вне индекса (%lld)
zh_hans: 未暂存（%lld）

source: Up
ru: Вверх
zh_hans: 上一级

source: Upgrade and restart this machine's HAPI runner before creating sessions.
ru: Обновите и перезапустите раннер HAPI этой машины перед созданием сессий.
zh_hans: 创建会话前，请升级并重启此机器上的 HAPI runner。

source: Upload failed — check the hub connection
ru: Ошибка загрузки — проверьте подключение к хабу
zh_hans: 上传失败 — 请检查 Hub 连接

source: Uploading…
ru: Загрузка…
zh_hans: 上传中…

source: Usage
ru: Использование
zh_hans: 用量

source: Use selected directory as-is
ru: Использовать выбранный каталог как есть
zh_hans: 直接使用选定的目录

source: Uses dangerous agent flags when spawning.
ru: Использует опасные флаги агента при запуске.
zh_hans: 启动时使用危险的代理标志。

source: Uses dangerous agent flags when spawning. Applies native %@ mode.
ru: Использует опасные флаги агента при запуске. Применяет нативный режим %@.
zh_hans: 启动时使用危险的代理标志。将应用原生 %@ 模式。

source: Version mismatch
ru: Несовпадение версий
zh_hans: 版本不匹配

source: View agent process
ru: Показать процесс агента
zh_hans: 查看子代理执行过程

source: View all
ru: Показать все
zh_hans: 查看全部

source: View current file
ru: Показать текущий файл
zh_hans: 查看当前文件

source: View full input
ru: Показать полный ввод
zh_hans: 查看完整输入

source: View full message
ru: Показать сообщение целиком
zh_hans: 查看完整消息

source: View full questions and answers
ru: Показать все вопросы и ответы
zh_hans: 查看完整问题与回答

source: View image
ru: Показать изображение
zh_hans: 查看图片

source: View process · %lld steps
ru: Показать процесс · %lld шага
zh_hans: 查看过程 · %lld 个步骤

source: View the full draft
ru: Показать черновик целиком
zh_hans: 查看草稿全文

source: View tool details
ru: Показать детали инструмента
zh_hans: 查看工具详情

source: View tool group
ru: Показать группу инструментов
zh_hans: 查看工具组

source: Wait for agent
ru: Ждать агента
zh_hans: 等待代理

source: Wait for result
ru: Ждать результат
zh_hans: 等待结果

source: Waiting for output…
ru: Ожидание вывода…
zh_hans: 等待输出…

source: Web fetch
ru: Веб-запрос
zh_hans: 获取网页

source: Web search
ru: Веб-поиск
zh_hans: 网络搜索

source: Workspace Roots
ru: Корни рабочего пространства
zh_hans: 工作区根目录

source: Workspace file
ru: Файл рабочего пространства
zh_hans: 工作区文件

source: Worktree sessions require an existing repository directory.
ru: Для сессий worktree нужен существующий каталог репозитория.
zh_hans: 工作树会话需要已存在的仓库目录。

source: Write draft
ru: Написать черновик
zh_hans: 写草稿

source: Write file
ru: Запись файла
zh_hans: 写入文件

source: Write-ahead log
ru: Журнал упреждающей записи
zh_hans: 预写日志

source: You already have a draft
ru: У вас уже есть черновик
zh_hans: 输入框中已有内容

source: Your answer
ru: Ваш ответ
zh_hans: 你的回答

source: Your input changed — review it and try again
ru: Ваш ввод изменился — проверьте его и попробуйте снова
zh_hans: 输入内容已发生变化，请检查后重试

source: error
ru: ошибка
zh_hans: 错误

source: feature-x (optional)
ru: feature-x (необязательно)
zh_hans: feature-x（可选）

source: now
ru: сейчас
zh_hans: 刚刚

source: pending
ru: ожидает
zh_hans: 等待中

source: — Canceled
ru: — Отменено
zh_hans: — 已取消

source: ● Recording… %@
ru: ● Запись… %@
zh_hans: ● 录音中… %@

source: ✓ Approved
ru: ✓ Одобрено
zh_hans: ✓ 已批准

source: ✕ Denied
ru: ✕ Отклонено
zh_hans: ✕ 已拒绝

source: Worktree
zh_hans: 工作树
